In [1]:
import numpy as np
import pandas as pd

In [2]:
my_df = pd.DataFrame(np.random.randn(4, 5),[1, 2, 3, 4], 
                     ['red', 'orange', 'yellow', 'green', 'blue'])

In [3]:
my_df

        red    orange    yellow     green      blue
1  0.478994  0.799810 -0.821576  0.388871 -0.259173
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541
3  1.029077 -0.116985 -1.370840  0.828849 -0.805605
4  0.214837 -2.374452 -0.355254  0.818456  0.070614

In [4]:
my_df['orange']

1    0.799810
2   -0.933194
3   -0.116985
4   -2.374452
Name: orange, dtype: float64

In [5]:
my_df['red']

1    0.478994
2   -0.055303
3    1.029077
4    0.214837
Name: red, dtype: float64

In [6]:
type(my_df['orange'])

pandas.core.series.Series

In [7]:
type(my_df)

pandas.core.frame.DataFrame

In [9]:
my_df[['yellow', 'blue']]

     yellow      blue
1 -0.821576 -0.259173
2 -0.682497  1.247541
3 -1.370840 -0.805605
4 -0.355254  0.070614

In [10]:
type(my_df[['yellow', 'blue']])

pandas.core.frame.DataFrame

In [11]:
my_df['indigo'] = my_df['blue']

In [12]:
my_df

        red    orange    yellow     green      blue    indigo
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.259173
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  1.247541
3  1.029077 -0.116985 -1.370840  0.828849 -0.805605 -0.805605
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.070614

In [13]:
my_df['violet'] = my_df['blue'] + my_df['indigo']

In [14]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.259173 -0.518346
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  1.247541  2.495082
3  1.029077 -0.116985 -1.370840  0.828849 -0.805605 -0.805605 -1.611210
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.070614  0.141227

In [15]:
my_df.loc[2]

red      -0.055303
orange   -0.933194
yellow   -0.682497
green     0.906130
blue      1.247541
indigo    1.247541
violet    2.495082
Name: 2, dtype: float64

In [20]:
my_df.iloc[2] = my_df.loc[2]

In [21]:
my_df.iloc[2]

red      -0.055303
orange   -0.933194
yellow   -0.682497
green     0.906130
blue      1.247541
indigo    1.247541
violet    2.495082
Name: 3, dtype: float64

In [25]:
my_df.loc[3, 'orange']

-0.93319409702939

In [26]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.259173 -0.518346
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  1.247541  2.495082
3 -0.055303 -0.933194 -0.682497  0.906130  1.247541  1.247541  2.495082
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.070614  0.141227

In [28]:
my_df.loc[[1, 3], ['blue', 'violet']]

       blue    violet
1 -0.259173 -0.518346
3  1.247541  2.495082

In [31]:
my_df.drop(3, inplace=True)

In [32]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.259173 -0.518346
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  1.247541  2.495082
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.070614  0.141227

In [34]:
my_df.drop('indigo', axis=1)

        red    orange    yellow     green      blue    violet
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.518346
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  2.495082
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.141227

In [35]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.259173 -0.518346
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  1.247541  2.495082
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.070614  0.141227

In [36]:
my_df.drop('indigo', axis=1, inplace=True)

In [37]:
my_df

        red    orange    yellow     green      blue    violet
1  0.478994  0.799810 -0.821576  0.388871 -0.259173 -0.518346
2 -0.055303 -0.933194 -0.682497  0.906130  1.247541  2.495082
4  0.214837 -2.374452 -0.355254  0.818456  0.070614  0.141227

In [38]:
my_df.shape

(3, 6)